bench/results/server1/apiary-0.14.0.1/DEEP.log
Benchmarking DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    64.34ms  145.03ms   1.16s    98.19%
    Req/Sec     1.10k   333.40     2.78k    84.01%
  260887 requests in 30.01s, 30.35MB read
  Socket errors: connect 0, read 0, write 0, timeout 95
Requests/sec:   8694.15
Transfer/sec:      1.01MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    44.48ms   11.75ms   1.11s    92.20%
    Req/Sec     1.17k   401.80     3.75k    80.02%
  259344 requests in 30.00s, 30.17MB read
  Socket errors: connect 0, read 0, write 0, timeout 110
Requests/sec:   8644.35
Transfer/sec:      1.01MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    72.95ms  109.23ms   1.89s    95.11%
    Req/Sec     1.15k   604.72     3.97k    76.86%
  256835 requests in 30.01s, 29.88MB read
Requests/sec:   8559.54
Transfer/sec:      1.00MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.52ms   13.85ms 105.29ms   89.04%
    Req/Sec     1.17k   544.02     3.52k    77.74%
  259317 requests in 30.00s, 30.17MB read
Requests/sec:   8642.54
Transfer/sec:      1.01MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.07ms   17.78ms   1.09s    91.62%
    Req/Sec     1.16k   531.53     3.52k    79.96%
  259193 requests in 30.01s, 30.16MB read
Requests/sec:   8638.31
Transfer/sec:      1.01MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.27ms   24.58ms   1.64s    93.11%
    Req/Sec     1.16k   535.47     3.76k    76.84%
  260623 requests in 30.00s, 30.32MB read
Requests/sec:   8686.16
Transfer/sec:      1.01MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.14ms   23.67ms   1.87s    92.98%
    Req/Sec     1.16k   520.97     3.47k    82.46%
  258975 requests in 30.01s, 30.13MB read
Requests/sec:   8630.95
Transfer/sec:      1.00MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    46.27ms   23.32ms   2.23s    95.19%
    Req/Sec     1.15k   468.37     2.97k    58.33%
  257883 requests in 30.01s, 30.00MB read
Requests/sec:   8594.34
Transfer/sec:      1.00MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    49.04ms   21.20ms 910.58ms   91.63%
    Req/Sec     1.15k   539.95     3.43k    79.37%
  256550 requests in 30.01s, 29.85MB read
Requests/sec:   8550.02
Transfer/sec:      0.99MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.21ms   14.54ms 781.87ms   90.24%
    Req/Sec     1.16k   542.04     3.83k    75.17%
  258799 requests in 30.01s, 30.11MB read
  Socket errors: connect 0, read 0, write 0, timeout 12
Requests/sec:   8624.81
Transfer/sec:      1.00MB
=================== summary ===================
ghc version:  7.8.2
bench target: apiary-0.14.0.1
bench:        DEEP
bench mode:   30s * 10
average:      8626.52
stdev:        47.42
=================== oneline ===================
7.8.2,apiary-0.14.0.1,DEEP,30s,10,8626.52,47.42